; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=123, out_folder=htg/blocksworld/training, instance_id=1, seed=2025, goal_proportion=0.03

(define (problem blocksworld-01)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 - object)
 (:init 
    (arm-empty)
    (clear b31)
    (on b31 b50)
    (on b50 b3)
    (on-table b3)
    (clear b64)
    (on-table b64)
    (clear b107)
    (on b107 b101)
    (on b101 b54)
    (on b54 b84)
    (on b84 b41)
    (on b41 b100)
    (on b100 b14)
    (on b14 b95)
    (on b95 b121)
    (on b121 b33)
    (on b33 b21)
    (on b21 b8)
    (on b8 b117)
    (on b117 b43)
    (on b43 b102)
    (on b102 b17)
    (on-table b17)
    (clear b55)
    (on b55 b93)
    (on b93 b29)
    (on b29 b105)
    (on b105 b88)
    (on b88 b63)
    (on-table b63)
    (clear b86)
    (on b86 b44)
    (on b44 b119)
    (on b119 b90)
    (on b90 b113)
    (on b113 b116)
    (on b116 b65)
    (on-table b65)
    (clear b47)
    (on b47 b56)
    (on b56 b10)
    (on b10 b69)
    (on b69 b61)
    (on b61 b24)
    (on b24 b19)
    (on b19 b109)
    (on-table b109)
    (clear b74)
    (on b74 b122)
    (on b122 b20)
    (on b20 b39)
    (on-table b39)
    (clear b34)
    (on b34 b35)
    (on b35 b75)
    (on b75 b85)
    (on b85 b78)
    (on b78 b40)
    (on-table b40)
    (clear b22)
    (on-table b22)
    (clear b60)
    (on b60 b2)
    (on b2 b38)
    (on b38 b96)
    (on-table b96)
    (clear b104)
    (on-table b104)
    (clear b37)
    (on-table b37)
    (clear b123)
    (on b123 b103)
    (on b103 b76)
    (on b76 b45)
    (on b45 b80)
    (on b80 b81)
    (on b81 b58)
    (on-table b58)
    (clear b42)
    (on b42 b118)
    (on b118 b57)
    (on b57 b36)
    (on b36 b87)
    (on b87 b12)
    (on b12 b115)
    (on b115 b97)
    (on b97 b18)
    (on-table b18)
    (clear b89)
    (on b89 b5)
    (on-table b5)
    (clear b32)
    (on b32 b106)
    (on b106 b27)
    (on-table b27)
    (clear b26)
    (on b26 b70)
    (on b70 b15)
    (on b15 b77)
    (on b77 b92)
    (on-table b92)
    (clear b67)
    (on-table b67)
    (clear b46)
    (on b46 b59)
    (on-table b59)
    (clear b51)
    (on-table b51)
    (clear b82)
    (on b82 b112)
    (on b112 b91)
    (on b91 b98)
    (on-table b98)
    (clear b94)
    (on b94 b25)
    (on-table b25)
    (clear b111)
    (on b111 b66)
    (on b66 b71)
    (on-table b71)
    (clear b4)
    (on b4 b79)
    (on b79 b7)
    (on b7 b53)
    (on-table b53)
    (clear b120)
    (on b120 b110)
    (on b110 b28)
    (on b28 b99)
    (on-table b99)
    (clear b16)
    (on b16 b6)
    (on-table b6)
    (clear b13)
    (on b13 b52)
    (on b52 b114)
    (on b114 b9)
    (on-table b9)
    (clear b30)
    (on-table b30)
    (clear b73)
    (on-table b73)
    (clear b49)
    (on b49 b48)
    (on b48 b1)
    (on b1 b68)
    (on-table b68)
    (clear b23)
    (on b23 b62)
    (on b62 b108)
    (on b108 b83)
    (on b83 b11)
    (on b11 b72)
    (on-table b72))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b1)
    (on-table b1))))

; plan
1. (unstack b31 b50)
   deleted: (on b31 b50) (clear b31) (arm-empty)
   added: (holding b31) (clear b50)
   goals met: 0 of 4
2. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 0 of 4
3. (unstack b49 b48)
   deleted: (on b49 b48) (clear b49) (arm-empty)
   added: (holding b49) (clear b48)
   goals met: 0 of 4
4. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 0 of 4
5. (unstack b48 b1)
   deleted: (on b48 b1) (clear b48) (arm-empty)
   added: (holding b48) (clear b1)
   goals met: 0 of 4
6. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 0 of 4
7. (unstack b1 b68)
   deleted: (on b1 b68) (clear b1) (arm-empty)
   added: (holding b1) (clear b68)
   goals met: 0 of 4
8. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 4
9. (unstack b50 b3)
   deleted: (on b50 b3) (clear b50) (arm-empty)
   added: (holding b50) (clear b3)
   goals met: 1 of 4
10. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 1 of 4
11. (unstack b60 b2)
   deleted: (on b60 b2) (clear b60) (arm-empty)
   added: (holding b60) (clear b2)
   goals met: 2 of 4
12. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 4
13. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 4
14. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 3 of 4
15. (unstack b2 b38)
   deleted: (on b2 b38) (clear b2) (arm-empty)
   added: (holding b2) (clear b38)
   goals met: 2 of 4
16. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 4 of 4
